shu = [
    "1111110",
    "0110000",
    "1101101",
    "1111001",
    "0110011",
    "1011011",
    "1011111",
    "1110000",
    "1111111",
    "1111011"
]
num = [
    "0000011", "1001011", "0000001", "0100001", "0101011", "0110110",
    "1111111", "0010110", "0101001", "0010110", "1011100", "0100110",
    "1010000", "0010011", "0001111", "0101101", "0110101", "1101010"
]
def f(d):
    a = []
    # 遍历可迭代对象时，同时获取「索引」和「对应的值」
    for i, t in enumerate(shu): # i是数字0~9，t是该数字i的标准七段码
        flag = True  #先假设这个数字 i 是可能的
        for j in range(7):
            # 关键规则：故障码d的第j位是1（亮），则标准码t的第j位必须也是1（亮）
            if d[j] == '1' and t[j] == '0':
                flag = False
                break
        if flag:
            a.append(i)
    return a
n = 1
for x in num:
    n *= len(f(x))
print(n)

